In [61]:
#Importo las librarias a utilizar para el EDA
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sb

In [2]:
#Importo archivos csv 
insurance_df = pd.read_csv('insurance_data.csv')
vehicle_df = pd.read_csv('vehicle_info.csv')

C:\Users\corrx003\AppData\Local\Temp\1\ipykernel_13516\1764519151.py:3: DtypeWarning: Columns (3,5) have mixed types. Specify dtype option on import or set low_memory=False.
  vehicle_df = pd.read_csv('vehicle_info.csv')

In [3]:
#Variables 3 a 5 presentan mas de un data type, por lo que importo el csv con low_memory:False para identificar primero el problema
insurance_df = pd.read_csv('insurance_data.csv')
vehicle_df = pd.read_csv('vehicle_info.csv', low_memory=False)

In [4]:
#Confirmo que contiene 406,448 registros y 11 variables
insurance_df

,POLICY_ID,INSR_BEGIN,INSR_END,CUSTOMER_SENIORITY,SEX,INSR_TYPE,INSURED_VALUE,PREMIUM,VEHICLE_ID,USAGE,CLAIM_PAID
0,300226657,01-JUL-14,30-JUN-15,16,Female,1201,17000.00,163.200,5000546971,Private,NaN
1,300231460,01-JUL-14,30-JUN-15,1,Female,1202,2600000.00,45761.900,5000578640,Own service,30981.20
2,300046799,01-JUL-14,30-JUN-15,7,Female,1201,80000.00,907.200,5000059976,Private,NaN
3,300046807,01-JUL-14,30-JUN-15,0,Female,1201,225000.00,3690.550,5000059986,Private,NaN
4,300046812,01-JUL-14,30-JUN-15,1,Female,1202,950000.00,10441.890,5000059996,Own Goods,2167218.69
...,...,...,...,...,...,...,...,...,...,...,...
406443,300334494,07-AUG-17,06-AUG-18,1,Female,1202,695136.93,11279.320,5000778040,Own service,NaN
406444,300119191,07-AUG-17,06-AUG-18,6,Female,1202,900000.00,10828.750,5000213479,Own Goods,NaN
406445,300046288,07-AUG-17,06-AUG-18,0,Female,1201,700000.00,9644.525,5000070876,Private,NaN
406446,300256129,07-AUG-17,06-AUG-18,13,Female,1201,1500000.00,16694.150,5000626182,Private,NaN
406447,300254520,07-AUG-17,06-AUG-18,2,Female,1202,2000000.00,21931.750,5000614161,Own Goods,NaN

In [5]:
#Verifico tipo de datos. Las fechas pueden cambiarse a data type dates. El resto está ok. 
insurance_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 406448 entries, 0 to 406447
Data columns (total 11 columns):
 #   Column              Non-Null Count   Dtype
---  ------              --------------   -----
 0   POLICY_ID           406448 non-null  int64
 1   INSR_BEGIN          406448 non-null  object
 2   INSR_END            406448 non-null  object
 3   CUSTOMER_SENIORITY  406448 non-null  int64
 4   SEX                 406448 non-null  object
 5   INSR_TYPE           406448 non-null  int64
 6   INSURED_VALUE       406448 non-null  float64
 7   PREMIUM             406439 non-null  float64
 8   VEHICLE_ID          406448 non-null  int64
 9   USAGE               406448 non-null  object
 10  CLAIM_PAID          33040 non-null   float64
dtypes: float64(3), int64(4), object(4)
memory usage: 34.1+ MB

In [6]:
#Checkeo cantidad de null values, solo claim paid tiene, los cuales deberian ser 0.
insurance_df.isnull().sum()

POLICY_ID                  0
INSR_BEGIN                 0
INSR_END                   0
CUSTOMER_SENIORITY         0
SEX                        0
INSR_TYPE                  0
INSURED_VALUE              0
PREMIUM                    9
VEHICLE_ID                 0
USAGE                      0
CLAIM_PAID            373408
dtype: int64

In [7]:
#El data frame de vehículos contiene 222,439 registros y 7 variables
vehicle_df

,VEHICLE_ID,PROD_YEAR,SEATS_NUM,CARRYING_CAPACITY,TYPE_VEHICLE,CCM_TON,MAKE
0,5000029885,2007.0,4.0,6.0,Pick-up,3153.0,NISSAN
1,5000029901,2010.0,4.0,7.0,Pick-up,2494.0,TOYOTA
2,5000030358,2012.0,0.0,220.0,Truck,12880.0,IVECO
3,5000031259,1999.0,11.0,0.0,Bus,2985.0,TOYOTA
4,5000031274,2000.0,12.0,12.0,Bus,2985.0,TOYOTA
...,...,...,...,...,...,...,...
222434,5001350484,2018.0,4.0,7.0,Pick-up,2400.0,TOYOTA
222435,5001350489,2018.0,4.0,7.0,Pick-up,2400.0,TOYOTA
222436,5001350498,2018.0,4.0,7.0,Pick-up,2400.0,TOYOTA
222437,5001350502,2018.0,4.0,7.0,Pick-up,2400.0,TOYOTA
222438,5001350505,2018.0,4.0,7.0,Pick-up,2400.0,TOYOTA

In [8]:
#Verifico tipo de datos. Variables 0, 3 y 5 figuran como object=Str y no int o float. Para poder hacer join de ambos data frames necesito que coincidan
#los tipos de datos de vehicle_id
vehicle_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 222439 entries, 0 to 222438
Data columns (total 7 columns):
 #   Column             Non-Null Count   Dtype
---  ------             --------------   -----
 0   VEHICLE_ID         222439 non-null  object
 1   PROD_YEAR          222435 non-null  float64
 2   SEATS_NUM          222416 non-null  float64
 3   CARRYING_CAPACITY  173473 non-null  object
 4   TYPE_VEHICLE       222435 non-null  object
 5   CCM_TON            222435 non-null  object
 6   MAKE               222432 non-null  object
dtypes: float64(2), object(5)
memory usage: 11.9+ MB

In [9]:
#Vehicle es str pero no tiene mixed data type. El resto si tienen str y float. 
print(vehicle_df['VEHICLE_ID'].apply(type).value_counts())
print(vehicle_df['CARRYING_CAPACITY'].apply(type).value_counts())
print(vehicle_df['TYPE_VEHICLE'].apply(type).value_counts())
print(vehicle_df['CCM_TON'].apply(type).value_counts())

<class 'str'>    222439
Name: VEHICLE_ID, dtype: int64
<class 'str'>      173473
<class 'float'>     48966
Name: CARRYING_CAPACITY, dtype: int64
<class 'str'>      222435
<class 'float'>         4
Name: TYPE_VEHICLE, dtype: int64
<class 'str'>      222435
<class 'float'>         4
Name: CCM_TON, dtype: int64

In [11]:
#Convierto las variables a numeric
vehicle_df['VEHICLE_ID'] = pd.to_numeric(vehicle_df['VEHICLE_ID'], errors='coerce')
vehicle_df['CARRYING_CAPACITY'] = pd.to_numeric(vehicle_df['CARRYING_CAPACITY'], errors='coerce')
vehicle_df['CCM_TON'] = pd.to_numeric(vehicle_df['CCM_TON'], errors='coerce')

In [12]:
#Confirmo cambio de data type
vehicle_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 222439 entries, 0 to 222438
Data columns (total 7 columns):
 #   Column             Non-Null Count   Dtype
---  ------             --------------   -----
 0   VEHICLE_ID         222435 non-null  float64
 1   PROD_YEAR          222435 non-null  float64
 2   SEATS_NUM          222416 non-null  float64
 3   CARRYING_CAPACITY  173472 non-null  float64
 4   TYPE_VEHICLE       222435 non-null  object
 5   CCM_TON            222434 non-null  float64
 6   MAKE               222432 non-null  object
dtypes: float64(5), object(2)
memory usage: 11.9+ MB

In [13]:
#Checkeo cantidad de null values. Vehicle_id y prod_year no deberian tener. 
vehicle_df.isnull().sum()

VEHICLE_ID               4
PROD_YEAR                4
SEATS_NUM               23
CARRYING_CAPACITY    48967
TYPE_VEHICLE             4
CCM_TON                  5
MAKE                     7
dtype: int64

In [14]:
#Busco los registros con NaN en vehicle_id y confirmo que no hay registro en esas 4 lineas. Por los que las remuevo del df.
df_with_na = vehicle_df[vehicle_df['VEHICLE_ID'].isna()]
print(df_with_na)

        VEHICLE_ID  PROD_YEAR  SEATS_NUM  CARRYING_CAPACITY TYPE_VEHICLE  \
54881          NaN        NaN        NaN                NaN          NaN
55192          NaN        NaN        NaN                NaN          NaN
193352         NaN        NaN        NaN                NaN          NaN
193353         NaN        NaN        NaN                NaN          NaN

        CCM_TON MAKE
54881       NaN  NaN
55192       NaN  NaN
193352      NaN  NaN
193353      NaN  NaN

In [15]:
#Remuevo los NaN en Vehicle_id del df
vehicle_df = vehicle_df.dropna(subset=['VEHICLE_ID'])

In [16]:
#Checkeo cantidad de null values. Vehicle_id y prod_year no deberian tener. 
vehicle_df.isnull().sum()

VEHICLE_ID               0
PROD_YEAR                0
SEATS_NUM               19
CARRYING_CAPACITY    48963
TYPE_VEHICLE             0
CCM_TON                  1
MAKE                     3
dtype: int64

In [20]:
#Identifico NaN values en seats_num, son 23 registros que pueden ser un error en data entry, tambien muchos de ellos tienen CCM_TON en 0 
#y Carrying_capacity con NaN values
df_with_na = vehicle_df[vehicle_df['SEATS_NUM'].isna()]
print(df_with_na)

Empty DataFrame
Columns: [VEHICLE_ID, PROD_YEAR, SEATS_NUM, CARRYING_CAPACITY, TYPE_VEHICLE, CCM_TON, MAKE]
Index: []

In [18]:
#Remuevo los NaN porque no son una perdida considerable del data set
vehicle_df = vehicle_df.dropna(subset=['SEATS_NUM'])

In [25]:
vehicle_df.isnull().sum()

VEHICLE_ID               0
PROD_YEAR                0
SEATS_NUM                0
CARRYING_CAPACITY    48953
TYPE_VEHICLE             0
CCM_TON                  0
MAKE                     2
dtype: int64

In [21]:
#Aquellos registros con carrying_capacity NaN parecen tener el resto de los datos completos, y son un 20% aprox de toda el df
#Y no seria correcto tener una capacidad de carga de 0 por lo que se lo mantiene en NaN por ahora.
df_with_na = vehicle_df[vehicle_df['CARRYING_CAPACITY'].isna()]
print(df_with_na)

          VEHICLE_ID  PROD_YEAR  SEATS_NUM  CARRYING_CAPACITY TYPE_VEHICLE  \
12      5.000032e+09     1993.0        5.0                NaN   Automobile
16      5.000032e+09     1995.0       12.0                NaN   Automobile
17      5.000032e+09     2000.0        7.0                NaN   Automobile
18      5.000032e+09     1999.0       10.0                NaN   Automobile
19      5.000032e+09     1997.0        9.0                NaN   Automobile
...              ...        ...        ...                ...          ...
222401  5.001334e+09     2017.0        1.0                NaN  Motor-cycle
222407  5.001331e+09     2018.0        4.0                NaN   Automobile
222417  5.001333e+09     2018.0        4.0                NaN   Automobile
222420  5.001329e+09     2006.0        4.0                NaN   Automobile
222429  5.001334e+09     2017.0        1.0                NaN  Motor-cycle

        CCM_TON    MAKE
12       4164.0  TOYOTA
16       4164.0  TOYOTA
17       2779.0  TOYOTA
18       4169.0  NISSAN
19       4169.0  NISSAN
...         ...     ...
222401    171.0   BOXER
222407   1600.0     BMW
222417   1600.0  TOYOTA
222420   1299.0  TOYOTA
222429    171.0   BOXER

[48954 rows x 7 columns]

In [23]:
df_with_na = vehicle_df[vehicle_df['CCM_TON'].isna()]
print(df_with_na)

        VEHICLE_ID  PROD_YEAR  SEATS_NUM  CARRYING_CAPACITY TYPE_VEHICLE  \
193354        17.0        2.0      150.0                NaN          0.0

        CCM_TON MAKE
193354      NaN  NaN

In [24]:
#Se borra registro con CCM_TON vacio 
vehicle_df = vehicle_df.dropna(subset=['CCM_TON'])

In [26]:
df_with_na = vehicle_df[vehicle_df['MAKE'].isna()]
print(df_with_na)

          VEHICLE_ID  PROD_YEAR  SEATS_NUM  CARRYING_CAPACITY  \
145577  5.000895e+09     2016.0        0.0              226.0
182270  5.001057e+09     2016.0        0.0              226.0

                     TYPE_VEHICLE  CCM_TON MAKE
145577  Trailers and semitrailers      0.0  NaN
182270  Trailers and semitrailers      0.0  NaN

In [27]:
#Se borra registro con MAKE vacio 
vehicle_df = vehicle_df.dropna(subset=['MAKE'])

In [52]:
insurance_df['CLAIM_PAID'].fillna(0, inplace=True)

In [51]:
insurance_df['CLAIM_PAID'] = pd.to_numeric(insurance_df['CLAIM_PAID'], errors='coerce')

In [54]:
merged_df= pd.merge(insurance_df, vehicle_df, on = 'VEHICLE_ID', how = 'inner')

In [114]:
merged_df

,POLICY_ID,INSR_BEGIN,INSR_END,CUSTOMER_SENIORITY,SEX,INSR_TYPE,INSURED_VALUE,PREMIUM,VEHICLE_ID,USAGE,CLAIM_PAID,PROD_YEAR,SEATS_NUM,CARRYING_CAPACITY,TYPE_VEHICLE,CCM_TON,MAKE,CLAIM
0,300226657,01-JUL-14,30-JUN-15,16,Female,1201,17000.00,163.20,5000546971,Private,0.00,1980.00,1.00,NaN,Motor-cycle,183.00,SUZUKI,0
1,300226656,01-JUL-15,30-JUN-16,29,Female,1201,17000.00,223.20,5000546971,Private,0.00,1980.00,1.00,NaN,Motor-cycle,183.00,SUZUKI,0
2,300231460,01-JUL-14,30-JUN-15,1,Female,1202,2600000.00,45761.90,5000578640,Own service,30981.20,2013.00,61.00,0.00,Bus,9700.00,BISHOFTU,1
3,300231459,01-JUL-15,30-JUN-16,0,Female,1202,2600000.00,45761.90,5000578640,Own service,127708.36,2013.00,61.00,0.00,Bus,9700.00,BISHOFTU,1
4,300231458,01-JUL-16,30-JUN-17,3,Female,1202,2600000.00,65515.00,5000578640,Own service,0.00,2013.00,61.00,0.00,Bus,9700.00,BISHOFTU,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
406128,300504321,07-AUG-17,06-AUG-18,5,Female,1201,1700000.00,4283.43,5001255424,Private,0.00,2012.00,8.00,NaN,Station Wagones,4164.00,TOYOTA,0
406129,300478457,07-AUG-17,06-AUG-18,14,Male,1201,0.00,608.40,5001107578,Private,0.00,2002.00,4.00,NaN,Automobile,1796.00,TOYOTA,0
406130,300506367,07-AUG-17,06-AUG-18,2,Female,1201,1500000.00,2143.32,5001272585,Private,0.00,2014.00,7.00,NaN,Station Wagones,4461.00,TOYOTA,0
406131,300505170,07-AUG-17,06-AUG-18,1,Female,1202,2691421.15,6166.49,5001249176,Own Goods,0.00,2018.00,6.00,9.00,Pick-up,4164.00,TOYOTA,0
406132,300505167,07-AUG-17,06-AUG-18,0,Female,1202,2691421.15,6176.49,5001249157,Own Goods,0.00,2018.00,6.00,9.00,Pick-up,4164.00,TOYOTA,0

In [56]:
merged_df.isnull().sum()

POLICY_ID                 0
INSR_BEGIN                0
INSR_END                  0
CUSTOMER_SENIORITY        0
SEX                       0
INSR_TYPE                 0
INSURED_VALUE             0
PREMIUM                   9
VEHICLE_ID                0
USAGE                     0
CLAIM_PAID                0
PROD_YEAR                 0
SEATS_NUM                 0
CARRYING_CAPACITY     94263
TYPE_VEHICLE              0
CCM_TON                   0
MAKE                      0
dtype: int64

In [57]:
merged_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 406133 entries, 0 to 406132
Data columns (total 17 columns):
 #   Column              Non-Null Count   Dtype
---  ------              --------------   -----
 0   POLICY_ID           406133 non-null  int64
 1   INSR_BEGIN          406133 non-null  object
 2   INSR_END            406133 non-null  object
 3   CUSTOMER_SENIORITY  406133 non-null  int64
 4   SEX                 406133 non-null  object
 5   INSR_TYPE           406133 non-null  int64
 6   INSURED_VALUE       406133 non-null  float64
 7   PREMIUM             406124 non-null  float64
 8   VEHICLE_ID          406133 non-null  int64
 9   USAGE               406133 non-null  object
 10  CLAIM_PAID          406133 non-null  float64
 11  PROD_YEAR           406133 non-null  float64
 12  SEATS_NUM           406133 non-null  float64
 13  CARRYING_CAPACITY   311870 non-null  float64
 14  TYPE_VEHICLE        406133 non-null  object
 15  CCM_TON             406133 non-null  float64
 16  MAKE                406133 non-null  object
dtypes: float64(7), int64(4), object(6)
memory usage: 55.8+ MB

In [58]:
pd.set_option('display.float_format', lambda x: '{:.2f}'.format(x))

In [113]:
merged_df.describe()

,POLICY_ID,CUSTOMER_SENIORITY,INSR_TYPE,INSURED_VALUE,PREMIUM,VEHICLE_ID,CLAIM_PAID,PROD_YEAR,SEATS_NUM,CARRYING_CAPACITY,CCM_TON,CLAIM
count,406133.00,406133.00,406133.00,406133.00,406124.00,406133.00,406133.00,406133.00,406133.00,311870.00,406133.00,406133.00
mean,300232906.97,4.88,1201.75,576595.09,8072.10,5000524764.91,20002.63,2005.86,6.25,461.88,3172.94,0.08
std,137277.62,6.39,0.43,938804.25,16337.48,331099.71,321598.35,9.77,14.05,3390.97,3430.14,0.27
min,300000001.00,0.00,1201.00,0.00,0.00,5000017900.00,0.00,1950.00,0.00,0.00,0.00,0.00
25%,300113968.00,1.00,1202.00,0.00,737.15,5000194401.00,0.00,2001.00,1.00,0.00,200.00,0.00
50%,300232032.00,2.00,1202.00,230000.00,3839.19,5000565931.00,0.00,2009.00,3.00,6.00,2494.00,0.00
75%,300348497.00,7.00,1202.00,850000.00,10849.75,5000798588.00,0.00,2013.00,4.00,30.00,4164.00,0.00
max,300508115.00,63.00,1204.00,67824388.47,7581230.43,5001275809.00,79247141.10,2018.00,198.00,224000.00,20000.00,1.00

In [125]:
merged_df['SEX'].value.counts().plot.pie(startangle=45, )

AttributeError: 'Series' object has no attribute 'value'

In [112]:
merged_df['CLAIM'] = merged_df['CLAIM_PAID'] .apply(lambda x: 0 if x == 0 else 1).astype(int)